Revit 2015 API
Curve.GetEndParameter Method
 Returns the raw parameter value at the start or end of this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public double GetEndParameter(
	int index
)
Visual Basic
Public Function GetEndParameter ( _
	index As Integer _
) As Double
Visual C++
public:
double GetEndParameter(
	int index
)
Parameters
index
Type: System.Int32
 0 for the start or 1 for end of the curve.
Return Value
 The parameter.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  curve is unbound and does not have start and end points. -or- index must be 0 for the start of the curve or 1 for the end.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Curve Class
Autodesk.Revit.DB Namespace